
/* var result = 'number'+3 +3 //Якщо додавати строку до числа, то число перетвориться на строку і трапиться конкатинація - обʼєднання.
console.log (result)
Результат: number33 */

/* var result = null + 3  //JS завжди намагається привести до числа. Null - має значення 0. 
 console.log (result) 
Результат: 3 */

/* var result = 5 && "qwerty" //Логічний оператор And (I). Обчислює до першого значення False, але якщо дійшов до кінця (тобто всі true), то повертає останню перемінну. 5 - true. qwerty - true. Повертає "qwerty" 
console.log (result)
Результат: qwerty */

/* var result = +'40' + +'2' + "hillel" // Унарний плюс завжди намагається привести строку до числа. Він привів "40" до числа 40 та "2" до числа 2. Додав їх між собою та отримали 42. Далі сталася конкатинація, він перевів число 42 до "42" і обʼєднав строку "hillel".
console.log (result)
Результат: 42hillel */

/* var result = '10' - 5 === 6 // "10" привели до числа та відняли 5 = 5. "===" - оператор строгої рівності. 5 не дорівнює 6. 
console.log (result)
Результат: false */

/* var boolean = true + false // Boolean тип значень true - 1, false - 0 
console.log (boolean)
Результат: 1 */

/* var result = '4px' - 3 // Nan - Not a number. JS намагався перевести строку "4px" в число та не зміг, бо там є і число, і літери.
console.log (result)
Результат: Nan */

/* var result ='4' - 3 // В даному випадку JS перевів "4" в число і сталася арифметична операція "віднімання"
console.log (result)
Результат: 1 */

/* var result = '6' + 3 ** 0 // Спочатку приводимо 3 в 0 ступінь і отримуємо 1. Далі в нас трапляється конкатинація і отримуємо рядок "61". 
console.log (result)
Результат:61 */

/* var result = 12 / '6' // Арифметична операція поділ. JS привів строку "6" до числа і зробив поділ
console.log (result)
Результат: 2 */

/* var result = '10' + (5 === 6) // Оператор строгої рівності "===" 5 не дорівнює 6 тобто результат = false. Порівняння завжди дає результати true/false. Далі трапилась конкатинація, оскільки "10" - рядок та false - рядок
console.log (result)
Результат: 10false */

/* var result = null == '' // Оператор нестрогої рівноті для null може бути true тільки в одному випадку - при порівнянні з undefined. А " " рахується як = 0
console.log (result)
Результат:false */

/* var result = 3 ** (9 / 3) // Спочатку дія в дужках. 9/3 = 3. 3 в третьму ступені буде 27. 
console.log (result)
Результат: 27 */

/* var result = !!'false' == !!'true' // В даному випадку "false" та "true" - це строки, тому оператор рівності сприймає їх як !!рядок == !!рядок і дає результат що вони рівні.
console.log (result)
Результат: true */

/* var result = 0 || '0' && 1 // Логічне And (І)та Or (Або) є лівоасоціативними. Тому цей вираз ми читаємо як 0 або "0" та отримуємо true тому що хоча б один з оперантів ("0") є true. Далі іде порівняння отриманого true та 1. Оскільки вони обидва true і ми дійшли до кінця, то отримали "1", як останнє обчислене значення.
console.log (result)
Результат: 1 */

/* var result = (+null == false) < 1 // Унарний + завжди намагається привести до числа, тож "+null" = 0, отримуємо (0 == false (false - це теж 0)). (0 == 0) - це в нас виходить true, а true в свою чергу = 1. 1 не менше 1, тому результат false. 
console.log (result)
Результат: False */

/* var result = false && true || true // Читаємо з ліва на право. Логічний І (And) "false && true" дає true тільки якщо обидва оператни true. В нашому випадку буде false тому что перший оператор false. Далі у нас іде логічний оператор Or (або), повертає true, якщо хоч один оператор true. Порівнюємо false || true та отримуємо true.
console.log (result)
Результат: true */

/* var result =false && (false || true) // Спочатку дія в дужках. Логічний оператор Or (Або), повертає true, якщо хоч один оператор true. Порівнюємо (false || true) та отримуємо true. Далі Логічний І (And) "false && true" дає true тільки якщо обидва оператни true. В нашому випадку буде false тому что перший оператор false.
console.log (result)
Результат: false */

/* var result = (+null == false) < 1 ** 5 // Дія в дужках +null привели до числа та отримали 0. (0 == false) - true. 1 ** 5 = 1. true < 1 = це false, бо true це теж 1. 
console.log (result)
Результат: false */